#include <iostream>
#include <windows.h>
using namespace std;

//21. Вступ до ООП.Клас, аксесори, конструктор
//
//==================================================================== =
//клас, доступ, методи, аксесори
//==================================================================== =
//
//1. Клас BankAccount(банківський рахунок).
//- private - поля: char owner[50], double balance.
//- Метод init(newOwner) — копіює ім'я власника і встановлює balance = 0.
//- Інспектори : getOwner(), getBalance() — тіло всередині класу.
//- Модифікатор deposit(amount) — поповнює рахунок, лише якщо amount > 0;
//повертає true або false.Тіло — поза класом.
//- Модифікатор withdraw(amount) — знімає гроші, лише якщо amount > 0
//і amount не більше за balance; повертає true або false.Тіло — поза класом.
//- Метод print() — виводить «Власник : ..., баланс : ...».Тіло — поза класом.
//- У main : створіть рахунок, поповніть на 1000, зніміть 300,
//спробуйте зняти 5000 і виведіть повідомлення про помилку, виведіть рахунок.
//
//2. Клас Book(книга).
//- private - поля : char title[100], char author[50], int pages, int year.
//- Модифікатори : setTitle(newTitle), setAuthor(newAuthor) — копіюють рядок
//(як setName у Student).
//- Модифікатор setPages(newPages) — лише від 1 до 5000, повертає bool.
//- Модифікатор setYear(newYear) — лише від 1450 до 2026, повертає bool.
//- Інспектори : getTitle(), getAuthor(), getPages(), getYear().
//- Інспектор isThick() — повертає true, якщо сторінок більше 500.
//Зробіть його inline - методом, визначеним поза класом.
//- Метод print() — виводить усю інформацію про книгу і позначку «товста»,
//якщо isThick() повертає true.
//- У main : створіть дві книги, заповніть їх через сеттери, спробуйте
//встановити рік 3000 і виведіть повідомлення про помилку, виведіть обидві книги.


int main() {
    SetConsoleCP(65001);
    SetConsoleOutputCP(65001);

}